app/Controllers/Home.php

INSERT INTO `quiz_sessions` (`student_id`, `created_at`, `updated_at`) VALUES ('1', '2023-03-12 08:36:41', '2023-03-12 08:36:41')
---
                        'student_id'=>$student_id,
                        'started_at'=>date('Y-m-d H:i:s')
                    ];
                    if($sessionModel->save($session_data)){