app/Models/QuizModel.php

SELECT *
FROM `quiz_questions`
JOIN `options_table` ON `quiz_questions`.`question_id` = `options_table`.`question_id`
WHERE `quiz_questions`.`question_id` = '6'
---
    function questionWithOption($qtn_id){
        return $this->db->table($this->table)
                        ->join('options_table','quiz_questions.question_id = options_table.question_id')
                        ->where('quiz_questions.question_id',$qtn_id)
                        ->get()
                        ->getResult();